Revit 2024 API
InitialLuminousIntensity Properties
The InitialLuminousIntensity type exposes the following members.
Properties
Name | Description
InitialIntensityValue
 The calculated initial intensity value.
 (Inherited from InitialIntensity.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from InitialIntensity.)
Luminosity
 The luminosity value.
See Also
InitialLuminousIntensity Class
Autodesk.Revit.DB.Lighting Namespace